cracked-machine/DigitalCurrentSinkV3/SW/STM32L496_DigitalCurrentSinkV3/Src/DacUtilities.c
	}
	else
	{
		switch(channel2_max_triangle_amplitude)
		{
			case DAC_TRIANGLEAMPLITUDE_7:
				return "RAMP 30mA";
				break;
			case DAC_TRIANGLEAMPLITUDE_15:
				return "RAMP 80mA";
				break;
			case DAC_TRIANGLEAMPLITUDE_31:
				return "RAMP 160mA";
				break;
			case DAC_TRIANGLEAMPLITUDE_63:
				return "RAMP 340mA";
				break;
			case DAC_TRIANGLEAMPLITUDE_127:
				return "RAMP 680mA";
				break;
			case DAC_TRIANGLEAMPLITUDE_255:
				return "RAMP 1.4A";
				break;
			case DAC_TRIANGLEAMPLITUDE_511:
				return "RAMP 2.8A";
				break;
			case DAC_TRIANGLEAMPLITUDE_1023:
				return "RAMP 5.5A";
				break;
			case DAC_TRIANGLEAMPLITUDE_2047:
				return "RAMP 10A";
				break;
			case DAC_TRIANGLEAMPLITUDE_4095:
				return "RAMP 20A";
				break;
		}
	}
	return "DU:ERR:189";
}

/**
  * @brief 	set triangle amplitude for DAC channel
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  * @param  amplitude DACEx_lfsrunmask_triangleamplitude DACEx lfsrunmask triangle amplitude
  *         This parameter can be one of the following values:
  *				@arg DAC_TRIANGLEAMPLITUDE_15:		Select max triangle amplitude of 15
  *				@arg DAC_TRIANGLEAMPLITUDE_31:   	Select max triangle amplitude of 31
  *				@arg DAC_TRIANGLEAMPLITUDE_63: 		Select max triangle amplitude of 63
  *				@arg DAC_TRIANGLEAMPLITUDE_127:  	Select max triangle amplitude of 127
  * 			@arg DAC_TRIANGLEAMPLITUDE_255:  	Select max triangle amplitude of 255
  *				@arg DAC_TRIANGLEAMPLITUDE_511:   	Select max triangle amplitude of 511
  * 			@arg DAC_TRIANGLEAMPLITUDE_1023:  	Select max triangle amplitude of 1023
  *				@arg DAC_TRIANGLEAMPLITUDE_2047:  	Select max triangle amplitude of 2047
  * 			@arg DAC_TRIANGLEAMPLITUDE_4095:	Select max triangle amplitude of 4095
  *
  * @retval DACEx_lfsrunmask_triangleamplitude DACEx lfsrunmask triangle amplitude
  */

void DU_SetRampAmplitudeSetting(uint32_t Channel, uint32_t amplitude)
{
	if(Channel == DAC_CHANNEL_1)
		channel1_max_triangle_amplitude = amplitude;
	else
		channel2_max_triangle_amplitude = amplitude;

	printf("DAC_CHANNEL_1 Triangle Amplitude: %s\n", DU_GetRampAmplitudeSetting2String(DAC_CHANNEL_1));
	printf("DAC_CHANNEL_2 Triangle Amplitude: %s\n", DU_GetRampAmplitudeSetting2String(DAC_CHANNEL_2));
}

/**
  * @brief 	get noise amplitude for DAC channel
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  *
  * @retval DACEx_lfsrunmask_triangleamplitude DACEx lfsrunmask triangle amplitude
  */

uint32_t DU_GetRandAmplitudeSetting(uint32_t Channel)
{
	if(Channel == DAC_CHANNEL_1)
		return channel1_max_noise_amplitude;
	else
		return channel2_max_noise_amplitude;
}

/**
  * @brief 	get noise amplitude for DAC channel
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  *
  * @retval  amplitude DACEx_lfsrunmask_triangleamplitude DACEx lfsrunmask triangle amplitude
  *         This parameter can be one of the following values:
  *				@arg DAC_LFSRUNMASK_BITS1_0: Unmask DAC channel LFSR bit[1:0] for noise wave generation
  *				@arg DAC_LFSRUNMASK_BITS2_0: Unmask DAC channel LFSR bit[2:0] for noise wave generation
  *            	@arg DAC_LFSRUNMASK_BITS3_0: Unmask DAC channel LFSR bit[3:0] for noise wave generation
  *            	@arg DAC_LFSRUNMASK_BITS4_0: Unmask DAC channel LFSR bit[4:0] for noise wave generation
  *            	@arg DAC_LFSRUNMASK_BITS5_0: Unmask DAC channel LFSR bit[5:0] for noise wave generation
  *            	@arg DAC_LFSRUNMASK_BITS6_0: Unmask DAC channel LFSR bit[6:0] for noise wave generation
  *            	@arg DAC_LFSRUNMASK_BITS7_0: Unmask DAC channel LFSR bit[7:0] for noise wave generation
  *            	@arg DAC_LFSRUNMASK_BITS8_0: Unmask DAC channel LFSR bit[8:0] for noise wave generation
  *            	@arg DAC_LFSRUNMASK_BITS9_0: Unmask DAC channel LFSR bit[9:0] for noise wave generation
  *            	@arg DAC_LFSRUNMASK_BITS10_0: Unmask DAC channel LFSR bit[10:0] for noise wave generation
  *            	@arg DAC_LFSRUNMASK_BITS11_0: Unmask DAC channel LFSR bit[11:0] for noise wave generation
  *
  */

char* DU_GetRandAmplitudeSetting2String(uint32_t Channel)
{
	if(Channel == DAC_CHANNEL_1)
	{
		if	(channel1_max_noise_amplitude == DAC_LFSRUNMASK_BITS2_0)
			return "BITMASK2";
		if	(channel1_max_noise_amplitude == DAC_LFSRUNMASK_BITS3_0)
			return "BITMASK3";
		if	(channel1_max_noise_amplitude == DAC_LFSRUNMASK_BITS4_0)
			return "BITMASK4";
		if	(channel1_max_noise_amplitude == DAC_LFSRUNMASK_BITS5_0)
			return "BITMASK5";
		if	(channel1_max_noise_amplitude == DAC_LFSRUNMASK_BITS6_0)
			return "BITMASK6";
		if	(channel1_max_noise_amplitude == DAC_LFSRUNMASK_BITS7_0)
			return "BITMASK7";
		if	(channel1_max_noise_amplitude == DAC_LFSRUNMASK_BITS8_0)
			return "BITMASK8";
		if	(channel1_max_noise_amplitude == DAC_LFSRUNMASK_BITS9_0)
			return "BITMASK9";
		if	(channel1_max_noise_amplitude == DAC_LFSRUNMASK_BITS10_0)
			return "BITMASK10";
		if	(channel1_max_noise_amplitude == DAC_LFSRUNMASK_BITS11_0)
			return "BITMASK11";
	}
	else
	{
		if	(channel2_max_noise_amplitude == DAC_LFSRUNMASK_BITS2_0)
			return "BITMASK2";
		if	(channel2_max_noise_amplitude == DAC_LFSRUNMASK_BITS3_0)
			return "BITMASK3";
		if	(channel2_max_noise_amplitude == DAC_LFSRUNMASK_BITS4_0)
			return "BITMASK4";
		if	(channel2_max_noise_amplitude == DAC_LFSRUNMASK_BITS5_0)
			return "BITMASK5";
		if	(channel2_max_noise_amplitude == DAC_LFSRUNMASK_BITS6_0)
			return "BITMASK6";
		if	(channel2_max_noise_amplitude == DAC_LFSRUNMASK_BITS7_0)
			return "BITMASK7";
		if	(channel2_max_noise_amplitude == DAC_LFSRUNMASK_BITS8_0)
			return "BITMASK8";
		if	(channel2_max_noise_amplitude == DAC_LFSRUNMASK_BITS9_0)
			return "BITMASK9";
		if	(channel2_max_noise_amplitude == DAC_LFSRUNMASK_BITS10_0)
			return "BITMASK10";
		if	(channel2_max_noise_amplitude == DAC_LFSRUNMASK_BITS11_0)
			return "BITMASK11";
	}


	return "DU:ERR:189";
}

/**
  * @brief 	set noise amplitude for DAC channel
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  * @param  amplitude DACEx_lfsrunmask_triangleamplitude DACEx lfsrunmask triangle amplitude
  *         This parameter can be one of the following values:
  *				@arg DAC_LFSRUNMASK_BIT0: Unmask DAC channel LFSR bit0 for noise wave generation
  *				@arg DAC_LFSRUNMASK_BITS1_0: Unmask DAC channel LFSR bit[1:0] for noise wave generation
  *				@arg DAC_LFSRUNMASK_BITS2_0: Unmask DAC channel LFSR bit[2:0] for noise wave generation
  *            	@arg DAC_LFSRUNMASK_BITS3_0: Unmask DAC channel LFSR bit[3:0] for noise wave generation
  *            	@arg DAC_LFSRUNMASK_BITS4_0: Unmask DAC channel LFSR bit[4:0] for noise wave generation
  *            	@arg DAC_LFSRUNMASK_BITS5_0: Unmask DAC channel LFSR bit[5:0] for noise wave generation
  *            	@arg DAC_LFSRUNMASK_BITS6_0: Unmask DAC channel LFSR bit[6:0] for noise wave generation
  *            	@arg DAC_LFSRUNMASK_BITS7_0: Unmask DAC channel LFSR bit[7:0] for noise wave generation
  *            	@arg DAC_LFSRUNMASK_BITS8_0: Unmask DAC channel LFSR bit[8:0] for noise wave generation
  *            	@arg DAC_LFSRUNMASK_BITS9_0: Unmask DAC channel LFSR bit[9:0] for noise wave generation
  *            	@arg DAC_LFSRUNMASK_BITS10_0: Unmask DAC channel LFSR bit[10:0] for noise wave generation
  *            	@arg DAC_LFSRUNMASK_BITS11_0: Unmask DAC channel LFSR bit[11:0] for noise wave generation
  *
  * @retval DACEx_lfsrunmask_triangleamplitude DACEx lfsrunmask triangle amplitude
  */

void DU_SetRandAmplitudeSetting(uint32_t Channel, uint32_t amplitude)
{
	if(Channel == DAC_CHANNEL_1)
		channel1_max_noise_amplitude = amplitude;
	else
		channel2_max_noise_amplitude = amplitude;

	printf("DAC_CHANNEL_1 Noise Amplitude: %s\n", DU_GetRandAmplitudeSetting2String(DAC_CHANNEL_1));
	printf("DAC_CHANNEL_2 Noise Amplitude: %s\n", DU_GetRandAmplitudeSetting2String(DAC_CHANNEL_2));
}


/**
  * @brief 	Calculate the DAC channel output voltage based
  *  		on chanX_amp_count_preview or DOR register
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  * @param	preview Select chanX_amp_count_preview or DOR register
  *
  * @retval DAC channel output voltage
  */

float DU_CalcVoltsFromBits(uint32_t Channel, uint8_t preview)
{
	float result = 0;
	if(Channel == DAC_CHANNEL_1)
	{
		if(preview)
			result = (float)(VREF * ((float)chan1_amp_count_preview/(float)DACRES));
		else
			result = (float)(VREF * ((float)hdac1.Instance->DOR1/(float)DACRES));
	}
	if(Channel == DAC_CHANNEL_2)
	{
		if(preview)
			result = (float)(VREF * ((float)chan2_amp_count_preview/(float)DACRES));
		else
			result = (float)(VREF * ((float)hdac1.Instance->DOR2/(float)DACRES));
	}
	/* 	Round up to the nearest 2 decimal places e.g. 0.147 --> 0.15.
	*	This prevents truncation issues if the fp result is converted back to integer
	*	i.e. 0.9 would be truncated to 0 */
	return (ceil(result*100)/100);
}



/**
  * @brief	Calculate the Timer frequency based
  *  		on chanX_freq_count_preview or auto-reload (ARR) register
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  * @param	preview Select the chanX_freq_count_preview or auto-reload (ARR) register
  *
  * @retval The calculated frequency of the timer
  */

