cracked-machine/DigitalCurrentSinkV3/SW/STM32L496_DigitalCurrentSinkV3/Src/DacUtilities.c
float DU_CalcFreqFromBits(uint32_t Channel, uint8_t preview)
{
	float result = 0;
	if(Channel == DAC_CHANNEL_1)
	{
		if(preview && (DU_GetDACModePreview(DAC_CHANNEL_1) == DAC_AUTO))
			result = (float)MASTERCLK/((float)TIM_PSC_AUTOMODE * (float)chan1_freq_count_preview);
		else if(preview && (DU_GetDACModePreview(DAC_CHANNEL_1) == DAC_RAND))
			result = (float)MASTERCLK/((float)TIM_PSC_RANDMODE * (float)chan1_freq_count_preview);
		else
			result = (float)MASTERCLK/((float)htim6.Instance->PSC * (float)htim6.Instance->ARR);
	}
	if(Channel == DAC_CHANNEL_2)
	{
		if(preview && (DU_GetDACModePreview(DAC_CHANNEL_2) == DAC_AUTO))
			result = (float)MASTERCLK/((float)TIM_PSC_AUTOMODE * (float)chan2_freq_count_preview);
		else if(preview && (DU_GetDACModePreview(DAC_CHANNEL_2) == DAC_RAND))
			result = (float)MASTERCLK/((float)TIM_PSC_RANDMODE * (float)chan2_freq_count_preview);
		else
			result = (float)MASTERCLK/((float)htim7.Instance->PSC * (float)htim7.Instance->ARR);
	}
	return result;
}



/**
  * @brief Set chan1_amp_count_preview to new voltage
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  * @param	new_volts The new voltage value to set to chan1_amp_count_preview
  *
  * @retval none
  */

void DU_SetVoltagePreview(uint32_t Channel, float new_volts)
{
	if (Channel == DAC_CHANNEL_1)
	{
		chan1_amp_count_preview = _CalcNewDOR(new_volts);
		printf("New DAC_CHANNEL_1 Volt Request: %2.4fV\n", (float)DU_CalcVoltsFromBits(DAC_CHANNEL_1, 1));
	}

	else if (Channel == DAC_CHANNEL_2)
	{
		chan2_amp_count_preview = _CalcNewDOR(new_volts);
		printf("New DAC_CHANNEL_2 Volt Request: %2.4fV\n", (float)DU_CalcVoltsFromBits(DAC_CHANNEL_2,1));
	}
}

/**
  * @brief	Set the DAC DHR12R1 register to output a new voltage value
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  *
  * @retval none
  */

void DU_SetVoltage(uint32_t Channel)
{
	// start debug counter (DAC requires 1-3 cycles before completing conversion)
	__HAL_TIM_CLEAR_FLAG(&htim15, TIM_FLAG_UPDATE);
	HAL_TIM_Base_Start_IT(&htim15);

	if(DU_IsDualChannelMode())
	{
		// update register from the preview variable
		if(chan1_amp_count_preview > (DACRES-1))
		{
			hdac1.Instance->DHR12R1 = (DACRES-1);
			chan1_amp_count_preview = (DACRES-1);
		}
		else
		{
			hdac1.Instance->DHR12R1 = chan1_amp_count_preview;
		}
		// update register from the preview variable
		if(chan2_amp_count_preview > (DACRES-1))
		{
			hdac1.Instance->DHR12R2 = (DACRES-1);
			chan2_amp_count_preview = (DACRES-1);
		}
		else
		{
			hdac1.Instance->DHR12R2 = chan2_amp_count_preview;
		}
	}
	else
	{
		if (Channel == DAC_CHANNEL_1)
		{
			// update register from the preview variable
			if(chan1_amp_count_preview > (DACRES-1))
			{
				hdac1.Instance->DHR12R1 = (DACRES-1);
				chan1_amp_count_preview = (DACRES-1);
			}
			else
			{
				hdac1.Instance->DHR12R1 = chan1_amp_count_preview;
			}

		}

		else if (Channel == DAC_CHANNEL_2)
		{
			// update register from the preview variable
			if(chan2_amp_count_preview > (DACRES-1))
			{
				hdac1.Instance->DHR12R2 = (DACRES-1);
				chan2_amp_count_preview = (DACRES-1);
			}
			else
			{
				hdac1.Instance->DHR12R2 = chan2_amp_count_preview;
			}

		}
	}

}

/**
  * @brief	Zero the preview variable
  *
  * @retval none
  */

void DU_ClearVoltagePreview(uint32_t Channel)
{
	if(Channel == DAC_CHANNEL_1)
		chan1_amp_count_preview = 0;
	else
		chan2_amp_count_preview = 0;
}


/**
  * @brief Sets Timer auto-reload register (ARR) with chanX_freq_count_preview variable
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  *
  * @retval none
  */

void DU_SetFreq(uint32_t Channel)
{

	// start debug counter (DAC requires 1-3 cycles before completing conversion)
	__HAL_TIM_CLEAR_FLAG(&htim15, TIM_FLAG_UPDATE);
	HAL_TIM_Base_Start_IT(&htim15);


	if (Channel == DAC_CHANNEL_1)
	{
		htim6.Instance->ARR = chan1_freq_count_preview;
		//printf("New DAC_CHANNEL_1 Freq Setting: %2.2fHz\n", (float)DU_CalcFreqFromBits(DAC_CHANNEL_1, 0 ));
		//chan1_freq_hertz = (float)MASTERCLK/(htim6.Instance->PSC * htim6.Instance->ARR);
		//printf("Chan1 Freq: %2.4fHz (%u)\n", chan1_freq_hertz, chan1FreqCount);
	}
	else if (Channel == DAC_CHANNEL_2)
	{
		htim7.Instance->ARR = chan2_freq_count_preview;
		//printf("New DAC_CHANNEL_2 Freq Setting: %2.2fHz\n", (float)DU_CalcFreqFromBits(DAC_CHANNEL_2, 0 ));
		//chan2_freq_hertz = (float)MASTERCLK/(htim7.Instance->PSC * htim7.Instance->ARR);
		//printf("Chan2 Freq: %2.4fHz (%u)\n", chan2_freq_hertz, chan2FreqCount);
	}
}

/**
  * @brief Reset the chanX_freq_count_preview variable
  *
  * @retval none
  */

void DU_ClearFreqPreview(uint32_t Channel)
{

	if(Channel == DAC_CHANNEL_1)
		chan1_freq_count_preview = TIMRES;
	else
		chan2_freq_count_preview = TIMRES;
}

/**
  * @brief	Update the chanX_freq_count_preview variable
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  * @param new_hertz The new value
  *
  * @retval none
  */

void DU_SetFreqPreview(uint32_t Channel, float new_hertz)
{
	if (Channel == DAC_CHANNEL_1)
	{
		chan1_freq_count_preview = _CalcNewARR(DAC_CHANNEL_1, new_hertz, 1);
		printf("New DAC_CHANNEL_1 Freq Request: %2.4fHz\n", (float)DU_CalcFreqFromBits(DAC_CHANNEL_1,1));
		//htim6.Instance->ARR = (uint32_t)(MASTERCLK/(htim6.Instance->PSC * newHertz));
		//printf("New Freq request: %lu\n", newHertz);
		//chan1FreqHz = (float)MASTERCLK/(htim6.Instance->PSC * htim6.Instance->ARR);
		//printf("Chan1 Freq: %2.4fHz (%u)\n", chan1FreqHz, chan1FreqCount);
	}
	else if (Channel == DAC_CHANNEL_2)
	{
		chan2_freq_count_preview = _CalcNewARR(DAC_CHANNEL_2, new_hertz, 1);
		printf("New DAC_CHANNEL_2 Freq Request: %2.4fHz\n", (float)DU_CalcFreqFromBits(DAC_CHANNEL_2,1));
		/*htim7.Instance->ARR = (uint32_t)(MASTERCLK/(htim7.Instance->PSC * newHertz));
		printf("New Freq request: %lu\n", newHertz);
		chan2FreqHz = (float)MASTERCLK/(htim7.Instance->PSC * htim7.Instance->ARR);
		printf("Chan2 Freq: %2.4fHz (%u)\n", chan2FreqHz, chan2FreqCount);
		*/
	}
}

/**
  * @brief Increase selected DAC channel voltage or frequency
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  *
  * @retval none
  */

