cracked-machine/DigitalCurrentSinkV3/SW/STM32L496_DigitalCurrentSinkV3/Src/DacUtilities.c
void DU_IncreaseDAC(uint32_t Channel)
{
	DM_SetBlinkTimer(1);
	uint8_t currentDacMode = DU_GetDACModeActual(Channel);
	if(currentDacMode == DAC_USER)
	{
		_ChangeVoltage(Channel, 1);
		DU_SetVoltage(Channel);
	}
	else if (currentDacMode == DAC_AUTO)
	{
		_ChangeFreq(Channel, 1);
		DU_SetFreq(Channel);
	}
	else if (currentDacMode == DAC_RAND)
	{
		_ChangeFreq(Channel, 1);
		DU_SetFreq(Channel);
	}
}

/**
  * @brief  Decrease selected DAC channel voltage or frequency
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)

  * @retval none
  */

void DU_DecreaseDAC(uint32_t Channel)
{
	DM_SetBlinkTimer(1);
	uint8_t currentDacMode = DU_GetDACModeActual(Channel);
	if(currentDacMode == DAC_USER)
	{
		_ChangeVoltage(Channel, 0);
		DU_SetVoltage(Channel);
	}
	else if (currentDacMode == DAC_AUTO)
	{
		_ChangeFreq(Channel, 0);
		DU_SetFreq(Channel);
	}
	else if (currentDacMode == DAC_RAND)
	{
		_ChangeFreq(Channel, 0);
		DU_SetFreq(Channel);
	}
}


/**
  * @brief 	set temporary DAC mode (to be applied later on confirmation)
  *
  * @param  pNewMode The new DAC mode
  *         This parameter can be one of the following values:
  *            		DAC_ERROR 	= 	0x00,	// illegal channel request
  *					DAC_USER 	=	0x01,
  *					DAC_AUTO		= 	0x02,
  *					DAC_RAND	= 	0x03
  *
  * @retval none
  */

void DU_SetDACModePreview(uint32_t Channel, dacmode_t pNewMode)
{
	if(Channel == DAC_CHANNEL_1)
		channel1_dacmode_preview = pNewMode;
	else
		channel2_dacmode_preview = pNewMode;

}

/**
  * @brief 	get the temporary DAC mode
  *
  *
  * @retval DAC mode
  *         This parameter can be one of the following values:
  *            		DAC_ERROR 	= 	0x00,	// illegal channel request
  *					DAC_USER 	=	0x01,
  *					DAC_AUTO		= 	0x02,
  *					DAC_RAND	= 	0x03
  */

dacmode_t DU_GetDACModePreview(uint32_t Channel)
{
	if(Channel == DAC_CHANNEL_1)
		return channel1_dacmode_preview;
	else
		return channel2_dacmode_preview;
}



char* DU_GetDACModePreview2String(uint32_t Channel)
{
	if(Channel == DAC_CHANNEL_1)
	{
		switch(channel1_dacmode_preview)
		{
			case DAC_USER:
				return "USER";
				break;
			case DAC_RAND:
				return "RAND";
				break;
			case DAC_AUTO:
				return "AUTO";
				break;
			default:
				break;
		}
	}
	else
	{
		switch(channel2_dacmode_preview)
		{
			case DAC_USER:
				return "USER";
				break;
			case DAC_RAND:
				return "RAND";
				break;
			case DAC_AUTO:
				return "AUTO";
				break;
			default:
				break;

		}
	}

	// something went wrong
	return "ERR:DU146";

}

/**
  * @brief	Return the current DAC mode for the selected channel as enumerated value
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  *
  * @retval  The DAC mode
  * 		@arg	DAC_ERROR: 	illegal mode request
  *			@arg 	DAC_USER:	Normal mode
  *			@arg 	DAC_AUTO:	Auto mode
  *			@arg 	DAC_RAND:	Random mode
  */

dacmode_t DU_GetDACModeActual(uint32_t Channel)
{
	volatile uint32_t hdac_cr = hdac1.Instance->CR;
	if (Channel == DAC_CHANNEL_1)
	{
		if	(hdac_cr & DAC_CR_WAVE1_0)
		{
			return DAC_RAND;
		}
		else if (hdac_cr & DAC_CR_WAVE1_1)
		{
			return DAC_AUTO;
		}
		else
		{
			return DAC_USER;
		}
	}
	else if (Channel == DAC_CHANNEL_2)
	{
		if	(hdac_cr & DAC_CR_WAVE2_0)
		{
			return DAC_RAND;
		}
		else if (hdac_cr & DAC_CR_WAVE2_1)
		{
			return DAC_AUTO;
		}
		else
		{
			return DAC_USER;
		}
	}
	else
	{
		return DAC_ERROR;
	}
}

/**
  * @brief	Return the current DAC mode for the selected channel as string
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  *
  * @retval  The DAC mode
  *
  */

char* DU_GetDACModeActual2String(uint32_t Channel)
{
	volatile uint32_t hdac_cr = hdac1.Instance->CR;
	if (Channel == DAC_CHANNEL_1)
	{
		if	(hdac_cr & DAC_CR_WAVE1_0)
		{
			return "RAND";
		}
		else if (hdac_cr & DAC_CR_WAVE1_1)
		{
			return "AUTO";
		}
		else
		{
			return "USER";
		}
	}
	else if (Channel == DAC_CHANNEL_2)
	{
		if	(hdac_cr & DAC_CR_WAVE2_0)
		{
			return "RAND";
		}
		else if (hdac_cr & DAC_CR_WAVE2_1)
		{
			return "AUTO";
		}
		else
		{
			return "USER";
		}
	}
	else
	{
		return "ERR";
	}

}

/**
  * @brief Set the DAC mode for single channel. DAC re-init not required.
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  * @param	mode The selected DAC mode
  * 			@arg 	DAC_ERROR: 	illegal mode request
  *				@arg 	DAC_USER:	Normal mode
  *				@arg 	DAC_AUTO:	Auto mode
  *				@arg 	DAC_RAND:	Random mode
  *
  * @retval none
  */

void DU_SetDACModeActual(uint32_t Channel, dacmode_t mode)
{
	if (Channel == DAC_CHANNEL_1)
	{
		hdac1.Instance->CR &= ~(DAC_CR_WAVE1_Msk | DAC_CR_MAMP1_Msk);
		if(mode == DAC_USER)
		{
			hdac1.Instance->CR &= ~(DAC_CR_WAVE1_0 | DAC_CR_WAVE1_1);
		}
		else if (mode == DAC_RAND)
		{
			htim6.Instance->PSC = TIM_PSC_RANDMODE;
			HAL_DACEx_NoiseWaveGenerate(&hdac1,DAC_CHANNEL_1, channel1_max_noise_amplitude);
			//hdac1.Instance->CR |= (DAC_CR_WAVE1_0 | DAC_LFSRUNMASK_BITS11_0);
		}
		else if (mode == DAC_AUTO)
		{
			htim6.Instance->PSC = TIM_PSC_AUTOMODE;
			HAL_DACEx_TriangleWaveGenerate(&hdac1, DAC_CHANNEL_1, channel1_max_triangle_amplitude);
		}
	}
	else if (Channel == DAC_CHANNEL_2)
	{
		hdac1.Instance->CR &= ~(DAC_CR_WAVE2_Msk | DAC_CR_MAMP2_Msk);
		if(mode == DAC_USER)
		{
			hdac1.Instance->CR &= ~(DAC_CR_WAVE2_0 | DAC_CR_WAVE2_1);
		}
		else if (mode == DAC_RAND)
		{
			htim7.Instance->PSC = TIM_PSC_RANDMODE;
			HAL_DACEx_NoiseWaveGenerate(&hdac1,DAC_CHANNEL_2, channel2_max_noise_amplitude);
			//hdac1.Instance->CR |= (DAC_CR_WAVE2_0 | (DAC_LFSRUNMASK_BITS11_0 << (Channel & 0x10UL)));
		}
		else if (mode == DAC_AUTO)
		{
			htim7.Instance->PSC = TIM_PSC_AUTOMODE;
			HAL_DACEx_TriangleWaveGenerate(&hdac1, DAC_CHANNEL_2, channel2_max_triangle_amplitude);
		}
	}
}



/**
  * @brief Set the DAC mode for BOTH channels; Needs to stop and re-initialize the DAC
  *
  * @param	mode The selected DAC mode
  * 			@arg 	DAC_ERROR: 	illegal mode request
  *				@arg 	DAC_USER:	Normal mode
  *				@arg 	DAC_AUTO:	Auto mode
  *				@arg 	DAC_RAND:	Random mode
  *
  * @retval none
  */

void DU_SetDualDACModeActual(dacmode_t mode)
{
	HAL_DAC_Stop(&hdac1,DAC_CHANNEL_1);
	HAL_DAC_Stop(&hdac1,DAC_CHANNEL_2);
	HAL_DAC_DeInit(&hdac1);
	MX_DAC1_Init();


		hdac1.Instance->CR &= ~(DAC_CR_WAVE1_Msk | DAC_CR_MAMP1_Msk);
		if(mode == DAC_USER)
			hdac1.Instance->CR &= ~(DAC_CR_WAVE1_0 | DAC_CR_WAVE1_1);
		else if (mode == DAC_RAND)
			//hdac1.Instance->CR |= (DAC_CR_WAVE1_0 | DAC_LFSRUNMASK_BITS11_0);
			HAL_DACEx_NoiseWaveGenerate(&hdac1,DAC_CHANNEL_1, channel1_max_noise_amplitude);
		else if (mode == DAC_AUTO)
			HAL_DACEx_TriangleWaveGenerate(&hdac1, DAC_CHANNEL_1, channel1_max_triangle_amplitude);


		hdac1.Instance->CR &= ~(DAC_CR_WAVE2_Msk | DAC_CR_MAMP2_Msk);
		if(mode == DAC_USER)
			hdac1.Instance->CR &= ~(DAC_CR_WAVE2_0 | DAC_CR_WAVE2_1);
		else if (mode == DAC_RAND)
			//hdac1.Instance->CR |= (DAC_CR_WAVE2_0 | (DAC_LFSRUNMASK_BITS11_0 << (DAC_CHANNEL_2 & 0x10UL)));
			HAL_DACEx_NoiseWaveGenerate(&hdac1,DAC_CHANNEL_2, channel2_max_noise_amplitude);
		else if (mode == DAC_AUTO)
			HAL_DACEx_TriangleWaveGenerate(&hdac1, DAC_CHANNEL_2, channel2_max_triangle_amplitude);


