cracked-machine/DigitalCurrentSinkV3/SW/STM32L496_DigitalCurrentSinkV3/Src/DacUtilities.c
	HAL_DAC_Start(&hdac1,DAC_CHANNEL_1);
	HAL_DAC_Start(&hdac1,DAC_CHANNEL_2);

}

/**
  * @brief	Set the DAC dual mode status
  *
  * @param enable: 1=Dual Mode enabled, 0=Dual Mode disabled
  *
  * @retval None
  */

void DU_ToggleDualChannelMode(uint8_t enable)
{
	dual_channel_mode = enable;
}


/**
  * @brief	Get the DAC dual mode status
  *
  * @retval boolean: 1=Dual Mode enabled, 0=Dual Mode disabled
  *
  */

uint8_t DU_IsDualChannelMode()
{
	return dual_channel_mode;
}

/**
  * @brief	Debug output for output values. To be called by delayed action to
  * 		allow for 1-3 cycles required before register update
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  *
  * @retval none
  */

void DU_CompleteCallback(uint32_t Channel)
{
	if(DU_IsDualChannelMode())
	{
		if(DU_GetDACModeActual(DAC_CHANNEL_1) == DAC_USER)
			printf("New DAC_CHANNEL_1 Volt Setting: %2.4fV\n", DU_CalcVoltsFromBits(DAC_CHANNEL_1, 0 ));
		else
			printf("New DAC_CHANNEL_1 Freq Setting: %2.4fHz\n", (float)DU_CalcFreqFromBits(DAC_CHANNEL_1, 0 ));

		if(DU_GetDACModeActual(DAC_CHANNEL_2) == DAC_USER)
			printf("New DAC_CHANNEL_2 Volt Setting: %2.4fV\n", DU_CalcVoltsFromBits(DAC_CHANNEL_2, 0 ));
		else
			printf("New DAC_CHANNEL_2 Freq Setting: %2.4fHz\n", (float)DU_CalcFreqFromBits(DAC_CHANNEL_2, 0 ));

	}
	else
	{
		if(Channel == DAC_CHANNEL_1)
		{
			if(DU_GetDACModeActual(DAC_CHANNEL_1) == DAC_USER)
				printf("New DAC_CHANNEL_1 Volt Setting: %2.4fV\n", DU_CalcVoltsFromBits(DAC_CHANNEL_1, 0 ));
			else
				printf("New DAC_CHANNEL_1 Freq Setting: %2.4fHz\n", (float)DU_CalcFreqFromBits(DAC_CHANNEL_1, 0 ));
		}
		if(Channel == DAC_CHANNEL_2)
		{
			if(DU_GetDACModeActual(DAC_CHANNEL_2) == DAC_USER)
				printf("New DAC_CHANNEL_2 Volt Setting: %2.4fV\n", DU_CalcVoltsFromBits(DAC_CHANNEL_2, 0 ));
			else
				printf("New DAC_CHANNEL_2 Freq Setting: %2.4fHz\n", (float)DU_CalcFreqFromBits(DAC_CHANNEL_2, 0 ));
		}
	}


}


/**
  * @brief	Set the active DAC channel
  *
  * @param The active DAC channel.
  *         One of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected
  *
  *  @retval None
  */

void DU_SetActiveDACChannel(uint32_t Channel)
{
	selected_dac_channel = Channel;
	printf("Active DAC Channel = %s", DU_GetActiveDACChannel2String());
}

/**
  * @brief	Get the active DAC channel
  *
  * @retval The active DAC channel.
  *         One of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected
  *
  */

uint32_t DU_GetActiveDACChannel()
{
	return selected_dac_channel;
}

/**
  * @brief	Get the active DAC channel
  *
  * @retval The active DAC channel.
  *         One of the following values:
  *            	@arg "CHANNEL 1"
  *            	@arg "CHANNEL 2"
  *
  */

char* DU_GetActiveDACChannel2String()
{
	if(selected_dac_channel == DAC_CHANNEL_1)
		return "CH1";
	else
		return "CH2";
}



/**
  * @brief	Calculate new register value for DAC output register (DOR) in decimal-counted binary
  *
  *
  * @param volts The requested voltage to be converted
  *
  * @retval The decimal-counted binary version of the volts parameter
  */

uint32_t _CalcNewDOR(float volts)
{
	uint32_t result = (volts * DACRES) / VREF;
	return result;
}

/**
  * @brief	Calculate new register value for auto-reload register (ARR) in decimal-counted binary
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  * @param	hertz The frequency to convert to decimal-counted binary
  *
  *
  * @retval The decimal-counted binary version of the hertz parameter
  */

uint16_t _CalcNewARR(uint16_t Channel, float hertz, int preview)
{
	uint32_t result = 0;
	if(Channel == DAC_CHANNEL_1)
	{
		if(DU_GetDACModePreview(Channel) == DAC_AUTO && preview)
			result = (MASTERCLK / hertz) / TIM_PSC_AUTOMODE;
		if(DU_GetDACModePreview(Channel) == DAC_RAND && preview)
			result = (MASTERCLK / hertz) / TIM_PSC_RANDMODE;
		if(DU_GetDACModePreview(Channel) == DAC_AUTO && !preview)
			result = (MASTERCLK / hertz) / htim6.Instance->PSC;
		if(DU_GetDACModePreview(Channel) == DAC_RAND && !preview)
			result = (MASTERCLK / hertz) / htim6.Instance->PSC;
	}
	if(Channel == DAC_CHANNEL_2)
	{
		if(DU_GetDACModePreview(Channel) == DAC_AUTO && preview)
			result = (MASTERCLK / hertz) / TIM_PSC_AUTOMODE;
		if(DU_GetDACModePreview(Channel) == DAC_RAND && preview)
			result = (MASTERCLK / hertz) / TIM_PSC_RANDMODE;
		if(DU_GetDACModePreview(Channel) == DAC_AUTO && !preview)
			result = (MASTERCLK / hertz) / htim7.Instance->PSC;
		if(DU_GetDACModePreview(Channel) == DAC_RAND && !preview)
			result = (MASTERCLK / hertz) / htim7.Instance->PSC;
	}
	// clamp new ARR max to timer resolution, increase the PSC to get a lower ARR ceiling
	if(result > TIMRES)
		result = TIMRES;
	return result;
}


/**
  * @brief 	Increase or decrease the chan1_amp_count_preview variable
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  * @param	increase 1=Increase, 0=Decrease
  *
  * @retval none
  */

void _ChangeFreq(uint32_t Channel, int increase)
{
	if (Channel == DAC_CHANNEL_1)
	{
		// decrement cycle period to increase frequency
		if(increase)
			chan1_freq_count_preview -= MAXFREQSTEP;
		else
			chan1_freq_count_preview += MAXFREQSTEP;

		if((chan1_freq_count_preview < 1) | (chan1_freq_count_preview > TIMRES))
			chan1_freq_count_preview = TIMRES;

	}
	else if (Channel == DAC_CHANNEL_2)
	{
		// decrement cycle period to increase frequency
		if(increase)
			chan2_freq_count_preview -= MAXFREQSTEP;
		else
			chan2_freq_count_preview += MAXFREQSTEP;

		if((chan2_freq_count_preview < 1) | (chan2_freq_count_preview > TIMRES))
			chan2_freq_count_preview = TIMRES;

