cracked-machine/DigitalCurrentSinkV3/SW/STM32L496_DigitalCurrentSinkV3/Src/DacUtilities.c
	}
}

/**
  * @brief 	Cycle to next DAC mode
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  *
  * @retval none
  */

void _CycleDACMode(uint32_t Channel)
{
	uint8_t currentDacMode = DU_GetDACModeActual(Channel);
	if(currentDacMode == DAC_USER)
	{
		DU_SetDACModeActual(Channel, DAC_AUTO);
	}
	else if (currentDacMode == DAC_AUTO)
	{
		DU_SetDACModeActual(Channel, DAC_RAND);
	}
	else if (currentDacMode == DAC_RAND)
	{
		DU_SetDACModeActual(Channel, DAC_USER);
	}
}


/**
  * @brief	Increase or decrease the chan1_amp_count_preview variable
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  * @param	Increase 1=Increase,0=Decrease
  *
  * @retval
  */

void _ChangeVoltage(uint32_t Channel, int increase)
{
	if (Channel == DAC_CHANNEL_1)
	{
		if(increase)
			chan1_amp_count_preview += MAXAMPSTEP;
		else
			chan1_amp_count_preview -= MAXAMPSTEP;

		if((chan1_amp_count_preview < 1) | (chan1_amp_count_preview > DACRES))
			chan1_amp_count_preview = 0;

	}
	else if (Channel == DAC_CHANNEL_2)
	{
		if(increase)
			chan2_amp_count_preview += MAXAMPSTEP;
		else
			chan2_amp_count_preview -= MAXAMPSTEP;

		if((chan2_amp_count_preview < 1) | (chan2_amp_count_preview > DACRES))
			chan2_amp_count_preview = 0;

	}
}

/**
  * @brief	Zero the DAC output register and the preview variable
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  * @param
  * 		@arg @ref
  *
  *
  * @retval none
  */

void _ResetDACVoltage(uint32_t Channel)
{
	HAL_DAC_SetValue(&hdac1,Channel, DAC_ALIGN_8B_R, 0);
	if (Channel == DAC_CHANNEL_1)
	{
		chan1_amp_count_preview = 0;
	}
	else if (Channel == DAC_CHANNEL_2)
	{
		chan2_amp_count_preview = 0;
	}

}

/**
  * @brief Reset the selected DAC channel freq and update chanX_freq_hertz variable
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  *
  * @retval none
  */

void _ResetDACFreq(uint32_t Channel)
{
	HAL_DAC_SetValue(&hdac1,Channel, DAC_ALIGN_8B_R, 0);
	if (Channel == DAC_CHANNEL_1)
	{
		//chan1FreqCount = 0;
		// recalculate freq (hertz) output
		chan1_freq_hertz = DU_CalcFreqFromBits(Channel, 0);
		//chan1_freq_hertz = (float)MASTERCLK/(htim6.Instance->PSC * htim6.Instance->ARR);
	}
	else if (Channel == DAC_CHANNEL_2)
	{
		//chan2FreqCount = 0;
		// recalculate freq (hertz) output
		chan2_freq_hertz = DU_CalcFreqFromBits(Channel, 0);
		//chan2_freq_hertz = (float)MASTERCLK/(htim7.Instance->PSC * htim7.Instance->ARR);
	}

}
